<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/88fc2ecf-9764-4359-a951-e975afc831a5/terraform-bin -chdir=terraform show -no-color /tmp/plan.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/prod-notify/prod-notify-service"
        name                               = "prod-notify-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/prod-notify:53" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "app_task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/prod-notify:53" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-central-1:898587786287:task-definition/prod-notify" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "prod-notify" -> (known after apply)
      ~ revision                 = 53 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.postgres.random_password.master will be created
  + resource "random_password" "master" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 20
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.vpc.aws_db_subnet_group.database[0] will be created
  + resource "aws_db_subnet_group" "database" {
      + arn                     = (known after apply)
      + description             = "Database subnet group for prod.eu-central-1.notify"
      + id                      = (known after apply)
      + name                    = "prod.eu-central-1.notify"
      + name_prefix             = (known after apply)
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "prod.eu-central-1.notify"
        }
      + tags_all                = {
          + "Application" = "notify"
          + "Name"        = "prod.eu-central-1.notify"
          + "Namespace"   = "walletconnect"
          + "Stage"       = "prod"
        }
      + vpc_id                  = (known after apply)
    }

  # module.vpc.aws_route_table_association.database[0] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = "rtb-02035dbc034ce6b87"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.database[1] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = "rtb-00fb2c8aaabb804dd"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.database[2] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = "rtb-084f88b87a3ee9150"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.database[0] will be created
  + resource "aws_subnet" "database" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.7.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "prod.eu-central-1.notify-db-eu-central-1a"
        }
      + tags_all                                       = {
          + "Application" = "notify"
          + "Name"        = "prod.eu-central-1.notify-db-eu-central-1a"
          + "Namespace"   = "walletconnect"
          + "Stage"       = "prod"
        }
      + vpc_id                                         = "vpc-0859f7eadc0bab978"
    }

  # module.vpc.aws_subnet.database[1] will be created
  + resource "aws_subnet" "database" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.8.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "prod.eu-central-1.notify-db-eu-central-1b"
        }
      + tags_all                                       = {
          + "Application" = "notify"
          + "Name"        = "prod.eu-central-1.notify-db-eu-central-1b"
          + "Namespace"   = "walletconnect"
          + "Stage"       = "prod"
        }
      + vpc_id                                         = "vpc-0859f7eadc0bab978"
    }

  # module.vpc.aws_subnet.database[2] will be created
  + resource "aws_subnet" "database" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.9.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "prod.eu-central-1.notify-db-eu-central-1c"
        }
      + tags_all                                       = {
          + "Application" = "notify"
          + "Name"        = "prod.eu-central-1.notify-db-eu-central-1c"
          + "Namespace"   = "walletconnect"
          + "Stage"       = "prod"
        }
      + vpc_id                                         = "vpc-0859f7eadc0bab978"
    }

  # module.postgres.module.database_cluster.aws_iam_role.rds_enhanced_monitoring[0] will be created
  + resource "aws_iam_role" "rds_enhanced_monitoring" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "monitoring.rds.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = {
          + "Application" = "notify"
          + "Name"        = "walletconnect-prod-notify"
          + "Namespace"   = "walletconnect"
          + "Stage"       = "prod"
        }
      + unique_id             = (known after apply)
    }

  # module.postgres.module.database_cluster.aws_iam_role_policy_attachment.rds_enhanced_monitoring[0] will be created
  + resource "aws_iam_role_policy_attachment" "rds_enhanced_monitoring" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole"
      + role       = (known after apply)
    }

  # module.postgres.module.database_cluster.aws_rds_cluster.this[0] will be created
  + resource "aws_rds_cluster" "this" {
      + allocated_storage               = (known after apply)
      + allow_major_version_upgrade     = true
      + apply_immediately               = true
      + arn                             = (known after apply)
      + availability_zones              = (known after apply)
      + backtrack_window                = 0
      + backup_retention_period         = 7
      + cluster_identifier              = "prod-notify-database"
      + cluster_identifier_prefix       = (known after apply)
      + cluster_members                 = (known after apply)
      + cluster_resource_id             = (known after apply)
      + copy_tags_to_snapshot           = false
      + database_name                   = "postgres"
      + db_cluster_parameter_group_name = (known after apply)
      + db_subnet_group_name            = (sensitive value)
      + enable_global_write_forwarding  = false
      + enable_http_endpoint            = false
      + enabled_cloudwatch_logs_exports = [
          + "postgresql",
        ]
      + endpoint                        = (known after apply)
      + engine                          = "aurora-postgresql"
      + engine_mode                     = "provisioned"
      + engine_version                  = "15.3"
      + engine_version_actual           = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + iam_roles                       = (known after apply)
      + id                              = (known after apply)
      + kms_key_id                      = (known after apply)
      + master_password                 = (sensitive value)
      + master_user_secret              = (known after apply)
      + master_user_secret_kms_key_id   = (known after apply)
      + master_username                 = "root"
      + network_type                    = (known after apply)
      + port                            = 5432
      + preferred_backup_window         = "02:00-03:00"
      + preferred_maintenance_window    = "sun:05:00-sun:06:00"
      + reader_endpoint                 = (known after apply)
      + skip_final_snapshot             = false
      + storage_encrypted               = true
      + storage_type                    = (known after apply)
      + tags_all                        = {
          + "Application" = "notify"
          + "Name"        = "walletconnect-prod-notify"
          + "Namespace"   = "walletconnect"
          + "Stage"       = "prod"
        }
      + vpc_security_group_ids          = (known after apply)

      + serverlessv2_scaling_configuration {
          + max_capacity = 10
          + min_capacity = 2
        }

      + timeouts {}
    }

  # module.postgres.module.database_cluster.aws_rds_cluster_instance.this["1"] will be created
  + resource "aws_rds_cluster_instance" "this" {
      + apply_immediately                     = true
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + cluster_identifier                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_parameter_group_name               = (known after apply)
      + db_subnet_group_name                  = (sensitive value)
      + dbi_resource_id                       = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "aurora-postgresql"
      + engine_version                        = "15.3"
      + engine_version_actual                 = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "prod-notify-database-1"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.serverless"
      + kms_key_id                            = (known after apply)
      + monitoring_interval                   = 30
      + monitoring_role_arn                   = (known after apply)
      + network_type                          = (known after apply)
      + performance_insights_enabled          = (known after apply)
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + preferred_backup_window               = (known after apply)
      + preferred_maintenance_window          = "sun:05:00-sun:06:00"
      + promotion_tier                        = 0
      + publicly_accessible                   = false
      + storage_encrypted                     = (known after apply)
      + tags_all                              = {
          + "Application" = "notify"
          + "Name"        = "walletconnect-prod-notify"
          + "Namespace"   = "walletconnect"
          + "Stage"       = "prod"
        }
      + writer                                = (known after apply)

      + timeouts {}
    }

  # module.postgres.module.database_cluster.aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Control traffic to/from RDS Aurora prod-notify-database"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "prod-notify-database-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "prod-notify-database"
        }
      + tags_all               = {
          + "Application" = "notify"
          + "Name"        = "prod-notify-database"
          + "Namespace"   = "walletconnect"
          + "Stage"       = "prod"
        }
      + vpc_id                 = "vpc-0859f7eadc0bab978"
    }

  # module.postgres.module.database_cluster.aws_security_group_rule.this["vpc_ingress"] will be created
  + resource "aws_security_group_rule" "this" {
      + cidr_blocks              = [
          + "10.1.0.0/16",
        ]
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

Plan: 15 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  + postgres_url = (sensitive value)
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # module.ecs.aws_ecs_service.app_service will be updated in-place%0A  ~ resource "aws_ecs_service" "app_service" {%0A        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/prod-notify/prod-notify-service"%0A        name                               = "prod-notify-service"%0A        tags                               = {}%0A      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/prod-notify:53" -> (known after apply)%0A        # (15 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_task_definition.app_task_definition must be replaced%0A-/+ resource "aws_ecs_task_definition" "app_task_definition" {%0A      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/prod-notify:53" -> (known after apply)%0A      ~ arn_without_revision     = "arn:aws:ecs:eu-central-1:898587786287:task-definition/prod-notify" -> (known after apply)%0A      ~ container_definitions    = (sensitive value) # forces replacement%0A      ~ id                       = "prod-notify" -> (known after apply)%0A      ~ revision                 = 53 -> (known after apply)%0A      - tags                     = {} -> null%0A        # (9 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.postgres.random_password.master will be created%0A  + resource "random_password" "master" {%0A      + bcrypt_hash = (sensitive value)%0A      + id          = (known after apply)%0A      + length      = 20%0A      + lower       = true%0A      + min_lower   = 0%0A      + min_numeric = 0%0A      + min_special = 0%0A      + min_upper   = 0%0A      + number      = true%0A      + numeric     = true%0A      + result      = (sensitive value)%0A      + special     = false%0A      + upper       = true%0A    }%0A%0A  # module.vpc.aws_db_subnet_group.database[0] will be created%0A  + resource "aws_db_subnet_group" "database" {%0A      + arn                     = (known after apply)%0A      + description             = "Database subnet group for prod.eu-central-1.notify"%0A      + id                      = (known after apply)%0A      + name                    = "prod.eu-central-1.notify"%0A      + name_prefix             = (known after apply)%0A      + subnet_ids              = (known after apply)%0A      + supported_network_types = (known after apply)%0A      + tags                    = {%0A          + "Name" = "prod.eu-central-1.notify"%0A        }%0A      + tags_all                = {%0A          + "Application" = "notify"%0A          + "Name"        = "prod.eu-central-1.notify"%0A          + "Namespace"   = "walletconnect"%0A          + "Stage"       = "prod"%0A        }%0A      + vpc_id                  = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table_association.database[0] will be created%0A  + resource "aws_route_table_association" "database" {%0A      + id             = (known after apply)%0A      + route_table_id = "rtb-02035dbc034ce6b87"%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table_association.database[1] will be created%0A  + resource "aws_route_table_association" "database" {%0A      + id             = (known after apply)%0A      + route_table_id = "rtb-00fb2c8aaabb804dd"%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc.aws_route_table_association.database[2] will be created%0A  + resource "aws_route_table_association" "database" {%0A      + id             = (known after apply)%0A      + route_table_id = "rtb-084f88b87a3ee9150"%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc.aws_subnet.database[0] will be created%0A  + resource "aws_subnet" "database" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "eu-central-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.1.7.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name" = "prod.eu-central-1.notify-db-eu-central-1a"%0A        }%0A      + tags_all                                       = {%0A          + "Application" = "notify"%0A          + "Name"        = "prod.eu-central-1.notify-db-eu-central-1a"%0A          + "Namespace"   = "walletconnect"%0A          + "Stage"       = "prod"%0A        }%0A      + vpc_id                                         = "vpc-0859f7eadc0bab978"%0A    }%0A%0A  # module.vpc.aws_subnet.database[1] will be created%0A  + resource "aws_subnet" "database" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "eu-central-1b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.1.8.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name" = "prod.eu-central-1.notify-db-eu-central-1b"%0A        }%0A      + tags_all                                       = {%0A          + "Application" = "notify"%0A          + "Name"        = "prod.eu-central-1.notify-db-eu-central-1b"%0A          + "Namespace"   = "walletconnect"%0A          + "Stage"       = "prod"%0A        }%0A      + vpc_id                                         = "vpc-0859f7eadc0bab978"%0A    }%0A%0A  # module.vpc.aws_subnet.database[2] will be created%0A  + resource "aws_subnet" "database" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "eu-central-1c"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.1.9.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name" = "prod.eu-central-1.notify-db-eu-central-1c"%0A        }%0A      + tags_all                                       = {%0A          + "Application" = "notify"%0A          + "Name"        = "prod.eu-central-1.notify-db-eu-central-1c"%0A          + "Namespace"   = "walletconnect"%0A          + "Stage"       = "prod"%0A        }%0A      + vpc_id                                         = "vpc-0859f7eadc0bab978"%0A    }%0A%0A  # module.postgres.module.database_cluster.aws_iam_role.rds_enhanced_monitoring[0] will be created%0A  + resource "aws_iam_role" "rds_enhanced_monitoring" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "monitoring.rds.amazonaws.com"%0A                        }%0A                      + Sid       = ""%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = (known after apply)%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + role_last_used        = (known after apply)%0A      + tags_all              = {%0A          + "Application" = "notify"%0A          + "Name"        = "walletconnect-prod-notify"%0A          + "Namespace"   = "walletconnect"%0A          + "Stage"       = "prod"%0A        }%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # module.postgres.module.database_cluster.aws_iam_role_policy_attachment.rds_enhanced_monitoring[0] will be created%0A  + resource "aws_iam_role_policy_attachment" "rds_enhanced_monitoring" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole"%0A      + role       = (known after apply)%0A    }%0A%0A  # module.postgres.module.database_cluster.aws_rds_cluster.this[0] will be created%0A  + resource "aws_rds_cluster" "this" {%0A      + allocated_storage               = (known after apply)%0A      + allow_major_version_upgrade     = true%0A      + apply_immediately               = true%0A      + arn                             = (known after apply)%0A      + availability_zones              = (known after apply)%0A      + backtrack_window                = 0%0A      + backup_retention_period         = 7%0A      + cluster_identifier              = "prod-notify-database"%0A      + cluster_identifier_prefix       = (known after apply)%0A      + cluster_members                 = (known after apply)%0A      + cluster_resource_id             = (known after apply)%0A      + copy_tags_to_snapshot           = false%0A      + database_name                   = "postgres"%0A      + db_cluster_parameter_group_name = (known after apply)%0A      + db_subnet_group_name            = (sensitive value)%0A      + enable_global_write_forwarding  = false%0A      + enable_http_endpoint            = false%0A      + enabled_cloudwatch_logs_exports = [%0A          + "postgresql",%0A        ]%0A      + endpoint                        = (known after apply)%0A      + engine                          = "aurora-postgresql"%0A      + engine_mode                     = "provisioned"%0A      + engine_version                  = "15.3"%0A      + engine_version_actual           = (known after apply)%0A      + hosted_zone_id                  = (known after apply)%0A      + iam_roles                       = (known after apply)%0A      + id                              = (known after apply)%0A      + kms_key_id                      = (known after apply)%0A      + master_password                 = (sensitive value)%0A      + master_user_secret              = (known after apply)%0A      + master_user_secret_kms_key_id   = (known after apply)%0A      + master_username                 = "root"%0A      + network_type                    = (known after apply)%0A      + port                            = 5432%0A      + preferred_backup_window         = "02:00-03:00"%0A      + preferred_maintenance_window    = "sun:05:00-sun:06:00"%0A      + reader_endpoint                 = (known after apply)%0A      + skip_final_snapshot             = false%0A      + storage_encrypted               = true%0A      + storage_type                    = (known after apply)%0A      + tags_all                        = {%0A          + "Application" = "notify"%0A          + "Name"        = "walletconnect-prod-notify"%0A          + "Namespace"   = "walletconnect"%0A          + "Stage"       = "prod"%0A        }%0A      + vpc_security_group_ids          = (known after apply)%0A%0A      + serverlessv2_scaling_configuration {%0A          + max_capacity = 10%0A          + min_capacity = 2%0A        }%0A%0A      + timeouts {}%0A    }%0A%0A  # module.postgres.module.database_cluster.aws_rds_cluster_instance.this["1"] will be created%0A  + resource "aws_rds_cluster_instance" "this" {%0A      + apply_immediately                     = true%0A      + arn                                   = (known after apply)%0A      + auto_minor_version_upgrade            = true%0A      + availability_zone                     = (known after apply)%0A      + ca_cert_identifier                    = (known after apply)%0A      + cluster_identifier                    = (known after apply)%0A      + copy_tags_to_snapshot                 = false%0A      + db_parameter_group_name               = (known after apply)%0A      + db_subnet_group_name                  = (sensitive value)%0A      + dbi_resource_id                       = (known after apply)%0A      + endpoint                              = (known after apply)%0A      + engine                                = "aurora-postgresql"%0A      + engine_version                        = "15.3"%0A      + engine_version_actual                 = (known after apply)%0A      + id                                    = (known after apply)%0A      + identifier                            = "prod-notify-database-1"%0A      + identifier_prefix                     = (known after apply)%0A      + instance_class                        = "db.serverless"%0A      + kms_key_id                            = (known after apply)%0A      + monitoring_interval                   = 30%0A      + monitoring_role_arn                   = (known after apply)%0A      + network_type                          = (known after apply)%0A      + performance_insights_enabled          = (known after apply)%0A      + performance_insights_kms_key_id       = (known after apply)%0A      + performance_insights_retention_period = (known after apply)%0A      + port                                  = (known after apply)%0A      + preferred_backup_window               = (known after apply)%0A      + preferred_maintenance_window          = "sun:05:00-sun:06:00"%0A      + promotion_tier                        = 0%0A      + publicly_accessible                   = false%0A      + storage_encrypted                     = (known after apply)%0A      + tags_all                              = {%0A          + "Application" = "notify"%0A          + "Name"        = "walletconnect-prod-notify"%0A          + "Namespace"   = "walletconnect"%0A          + "Stage"       = "prod"%0A        }%0A      + writer                                = (known after apply)%0A%0A      + timeouts {}%0A    }%0A%0A  # module.postgres.module.database_cluster.aws_security_group.this[0] will be created%0A  + resource "aws_security_group" "this" {%0A      + arn                    = (known after apply)%0A      + description            = "Control traffic to/from RDS Aurora prod-notify-database"%0A      + egress                 = (known after apply)%0A      + id                     = (known after apply)%0A      + ingress                = (known after apply)%0A      + name                   = (known after apply)%0A      + name_prefix            = "prod-notify-database-"%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Name" = "prod-notify-database"%0A        }%0A      + tags_all               = {%0A          + "Application" = "notify"%0A          + "Name"        = "prod-notify-database"%0A          + "Namespace"   = "walletconnect"%0A          + "Stage"       = "prod"%0A        }%0A      + vpc_id                 = "vpc-0859f7eadc0bab978"%0A    }%0A%0A  # module.postgres.module.database_cluster.aws_security_group_rule.this["vpc_ingress"] will be created%0A  + resource "aws_security_group_rule" "this" {%0A      + cidr_blocks              = [%0A          + "10.1.0.0/16",%0A        ]%0A      + from_port                = 5432%0A      + id                       = (known after apply)%0A      + protocol                 = "tcp"%0A      + security_group_id        = (known after apply)%0A      + security_group_rule_id   = (known after apply)%0A      + self                     = false%0A      + source_security_group_id = (known after apply)%0A      + to_port                  = 5432%0A      + type                     = "ingress"%0A    }%0A%0APlan: 15 to add, 1 to change, 1 to destroy.%0A%0AChanges to Outputs:%0A  + postgres_url = (sensitive value)%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Action: `pull_request`*